11/data/attachments/d4d7e820e2ab071f.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_4ec86680-0f92-46e3-bcfb-16e9b8c56b92</nif:username>
            <nif:friendToBeAdded>James_democratic_Friend_25532_3</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>